using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lesson2
{
    class TasksText
    {
        public const string Task1Text = "Написать метод возвращающий минимальное из трех чисел.";
        public const string Task2Text = "Написать метод подсчета количества цифр числа.";
        public const string Task3Text = "С клавиатуры вводятся числа, пока не будет введен 0." +
            "\nПодсчитать сумму всех нечетных положительных чисел.";
        public const string Task4Text = "Реализовать метод проверки логина и пароля." +
            "\nНа вход подается логин и пароль. На выходе истина, если прошел авторизацию, и ложь, если не прошел(Логин:root, Password:GeekBrains)." +
            "\nИспользуя метод проверки логина и пароля, написать программу:" +
            "\nпользователь вводит логин и пароль, программа пропускает его дальше или не пропускает." +
            "\nС помощью цикла do while ограничить ввод пароля тремя попытками.";
        public const string Task5Text = "а) Написать программу, которая запрашивает массу и рост человека," +
            "\nвычисляет его индекс массы и сообщает, нужно ли человеку похудеть, набрать вес или все в норме;" +
            "\nб) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.";
        public const string Task6Text = "*Написать программу подсчета количества “Хороших” чисел в диапазоне от 1 до 1 000 000 000." +
            "\nХорошим называется число, которое делится на сумму своих цифр." +
            "\nРеализовать подсчет времени выполнения программы, используя структуру DateTime.";
        public const string Task7Text = "a) Разработать рекурсивный метод, который выводит на экран числа от a до b(a<b);" +
            "\nб) *Разработать рекурсивный метод, который считает сумму чисел от a до b.";
    }
}
